'''Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)'''
'''Ввод: [-5, 9, 0, 3, -1, -2, 1, 4,-2,10,2,0,-9,8,10,-9, 0, -5, -5, 7]
Вывод: [1, 9, 13, 14, 19]'''


'''from random import randint'''
min = 7
max = 10
random_array = [-5, 9, 0, 3, -1, -2, 1, 4,-2,10,2,0,-9,8,10,-9, 0, -5, -5, 7] #[randint(1, 10) for _ in range(20)]
print('Массив: ', random_array, sep=' ')
indexes = [i for i, j in enumerate(random_array) if min <= j <= max]
print('Индексы: ', indexes, sep=' ')
